{
  "projectItems": [
    {
      "id": 1,
      "title": "Lightbulb",
      "src": "/images/render/projects/lightBulb.png",
      "description": "I created a scene featuring light bulbs, using the array modifier for duplication. I added a glowing light effect to the bulbs and designed a pavement-like background using different nodes",
      "render": "lightBulb",
      "date": 1744934400000
    },
    {
      "id": 2,
      "title": "Pokeball",
      "src": "/images/render/realism/pokeball.png",
      "description": "This Pokeball was created using techniques I learned from a CG Cookie course. I explored texturing by applying various images to the object and gained a deeper understanding of shading nodes to fine-tune colors and achieve a stretched, aged appearance for the Pokeball",
      "render": "pokeball",
      "date": 1735207562000,
      "link": "https://cgcookie.com"
    },
    {
      "id": 3,
      "title": "Sci-fi Crate",
      "src": "/images/render/projects/sci-fi-crate.png",
      "description": "This design was inspired by CG Cookie course where I learned about 3D design and working with meshes. I applied principles of visual composition, using vibrant colors and gradients to create a futuristic sci-fi feel",
      "render": "sci-fi-crate",
      "date": 1726012800000,
      "link": "https://cgcookie.com"
    },
    {
      "id": 4,
      "title": "Coffee Cup",
      "src": "/images/render/projects/coffee-cup.png",
      "description": "Another CG Cookie exercise, this time a coffee cup. This task helped me understand how shadows enhance realism in objects",
      "render": "coffee-cup",
      "date": 1725926400000,
      "link": "https://cgcookie.com"
    },
    {
      "id": 5,
      "title": "Emil",
      "src": "/images/render/projects/emil.png",
      "description": "This is Emil, my first attempt at sculpting. It’s inspired by one of my favourite games, Nier: Automata. While it’s not an exact replica, I hope to create more pieces like this in the future",
      "render": "emil",
      "date": 1717977600000,
      "link": "https://www.square-enix-games.com/en_EU/games/nier-automata"
    },
    {
      "id": 6,
      "title": "Rabbit",
      "src": "/images/render/projects/rabbit.png",
      "description": "This is a low-poly rabbit model that I created to practice my skills in 3D modeling and texturing. The focus was on creating a simple yet appealing design that captures the essence of a rabbit without going into too much detail, I've used a gradient for shading to make it look more appealing and give it the look of a more polished model",
      "render": "rabbit",
      "date": 1747484360000
    },
    {
      "id": 7,
      "title": "Blender Logo",
      "src": "/images/render/projects/blender-logo.mp4",
      "description": "This is a simple animation of the Blender logo, created to practice my skills in animation and rendering. The focus was on creating a smooth and visually appealing animation that showcases the Blender logo in a dynamic way",
      "render": "blender-logo",
      "date": 1748380800000
    },
    {
      "id": 8,
      "title": "Doughnut",
      "src": "/images/render/projects/doughnut.mp4",
      "description": "This is my first 3D doughnut render, and I couldn’t go wrong following the Blender Guru tutorial. For anyone starting to learn Blender, following this tutorial is pretty much mandatory, it covers all the basics like modeling, texturing, and lighting to help you create realistic renders step by step",
      "render": "doughnut",
      "date": 1713523200000
    },
    {
      "id": 9,
      "title": "Coffee Cup wireframe",
      "src": "/images/render/wireframe/coffee-cup.png",
      "description": "This is a coffee cup wireframe created during the mesh course on CG Cookie, which helped me understand various shapes, mesh structure, and the purpose of quads and triangles in 3D modeling",
      "render": "coffee-cup-wireframe",
      "date": 1725753600000
    },
    {
      "id": 10,
      "title": "Blender wireframe",
      "src": "/images/render/wireframe/blender.png",
      "description": "This is a wireframe model created in Blender. Recreating this object helped me deepen my understanding of modeling. It’s part of a larger kitchen project that I’ll be updating here soon",
      "render": "blender-wireframe",
      "date": 1730505600000
    },
    {
      "id": 11,
      "title": "Galton board",
      "src": "/images/render/projects/galton-board.mp4",
      "description": "Created during a CG Cookie course on rigid body physics, this Galton board was a fun project to explore. I especially enjoyed the texturing process and was really pleased with how the final result turned out",
      "render": "galton-board",
      "date": 1745712000000
    },
    {
      "id": 12,
      "title": "Cat",
      "src": "/images/render/projects/cat.png",
      "description": "I created this glowing-eyed cat in Blender while learning how to rig and move objects using bone structures super fun to bring it to life! The tree in the scene is from TurboSquid",
      "render": "glowing-cat-at-night",
      "date": 1749732233200
    },
    {
      "id": 13,
      "title": "Ocean",
      "src": "/images/render/projects/ocean.mp4",
      "description": "A stylized cartoon ocean created in Blender using mainly shading nodes and rendered in Eevee. A simple project, but a fun experiment in non-photorealistic rendering",
      "render": "catoonish ocean",
      "date": 1749818413874
    },
    {
      "id": 14,
      "title": "Castle",
      "src": "/images/render/projects/castle.png",
      "description": "Low-poly castle scene created as part of a GameDev course. I modeled the walls, tower, and trees, then used shader nodes to apply stylized colors and built a simple sky using a color ramp. Rendered in Eevee",
      "render": "castle",
      "date": 1748818800000
    },
    {
      "id": 15,
      "title": "Spookie Corridor",
      "src": "/images/render/projects/spookie-corridor.mp4",
      "description": "I made this spooky corridor mostly by working with textures, learning how to UV unwrap and mark seams along the way. To make it creepier, I added a little animation at the end where a door slowly opens. The lights in the scene use emission nodes to create that glow",
      "render": "spookie-corridor",
      "date": 1750282775303
    },
    {
      "id": 16,
      "title": "Trees",
      "src": "/images/render/projects/trees.png",
      "description": "I created the bark texture using shader nodes, without relying on UV wrapping. Instead, I used the \"Object\" output from the Texture Coordinate node to map the texture. It was my first time sculpting a tree bark, and through the process, I learned how to use various sculpting tools to make organic forms look more realistic. The leaves were made using alpha textures",
      "render": "trees",
      "date": 1750335872264
    }
  ]
}
