{
  "projectItems": [
    {
      "id": 1,
      "title": "Lightbulb",
      "src": "/images/render/projects/lightBulb.png",
      "description": "I created a scene featuring light bulbs, using the array modifier for duplication. I added a glowing light effect to the bulbs and designed a pavement-like background using different nodes",
      "render": "lightBulb",
      "date": 1744934400000
    },
    {
      "id": 2,
      "title": "Pokeball",
      "src": "/images/render/realism/pokeball.png",
      "description": "This Pokeball was created using techniques I learned from a CG Cookie course. I explored texturing by applying various images to the object and gained a deeper understanding of shading nodes to fine-tune colors and achieve a stretched, aged appearance for the Pokeball",
      "render": "pokeball",
      "date": 1735207562000,
      "link": "https://cgcookie.com"
    },
    {
      "id": 3,
      "title": "Sci-fi Crate",
      "src": "/images/render/projects/sci-fi-crate.png",
      "description": "This design was inspired by CG Cookie course where I learned about 3D design and working with meshes. I applied principles of visual composition, using vibrant colors and gradients to create a futuristic sci-fi feel",
      "render": "sci-fi-crate",
      "date": 1726012800000,
      "link": "https://cgcookie.com"
    },
    {
      "id": 4,
      "title": "Coffee Cup",
      "src": "/images/render/projects/coffee-cup.png",
      "description": "Another CG Cookie exercise, this time a coffee cup. This task helped me understand how shadows enhance realism in objects",
      "render": "coffee-cup",
      "date": 1725926400000,
      "link": "https://cgcookie.com"
    },
    {
      "id": 5,
      "title": "Tea Pot",
      "src": "/images/render/realism/tea-pot.png",
      "description": "This teapot marks my first try at using geometry, which has significantly helped me enhance my skills by teaching me how shapes, proportions, and details come together to create a cohesive and realistic 3D model. It was a valuable learning experience that laid the foundation for future projects",
      "render": "tea-pot",
      "date": 1724889600000
    },
    {
      "id": 6,
      "title": "Emil",
      "src": "/images/render/projects/emil.png",
      "description": "This is Emil, my first attempt at sculpting. It’s inspired by one of my favourite games, /Nier: Automata/. While it’s not an exact replica, I hope to create more pieces like this in the future",
      "render": "emil",
      "date": 1717977600000,
      "link": "https://www.square-enix-games.com/en_EU/games/nier-automata"
    },
    {
      "id": 7,
      "title": "Rabbit",
      "src": "/images/render/projects/rabbit.png",
      "description": "This is a low-poly rabbit model that I created to practice my skills in 3D modeling and texturing. The focus was on creating a simple yet appealing design that captures the essence of a rabbit without going into too much detail, I've used a gradient for shading to make it look more appealing and give it the look of a more polished model",
      "render": "rabbit",
      "date": 1747484360000
    },
    {
      "id": 8,
      "title": "Blender Logo",
      "src": "/images/render/projects/blender-logo.mp4",
      "description": "This is a simple animation of the Blender logo, created to practice my skills in animation and rendering. The focus was on creating a smooth and visually appealing animation that showcases the Blender logo in a dynamic way",
      "render": "blender-logo",
      "date": 1748380800000
    },
    {
      "id": 9,
      "title": "Doughnut",
      "src": "/images/render/projects/doughnut.mp4",
      "description": "This is my first 3D doughnut render, and I couldn’t go wrong following the Blender Guru tutorial. For anyone starting to learn Blender, following this tutorial is pretty much mandatory, it covers all the basics like modeling, texturing, and lighting to help you create realistic renders step by step",
      "render": "doughnut",
      "date": 1713523200000
    }
  ]
}
